"USSD_ERROR" = "خطأ في تنفيذ الطلب";
"USSD_TERMINATED" = "انتهت الدورة";

"%@ Call Forwarding\n%@\n%@%@" = "‏%@ تحويل المكالمة\n%@\n‏%@‏%@
";
"%@ Call Waiting\n%@" = "‏%@ انتظار المكالمة\n%@";
"%@ Call Barring\n%@\n%@" = "%@ حظر المكالمة\n%@\n%@";
"%@ Fixed Dialing\n%@" = "‏%@ الاتصال بأرقام محددة\n%@";
"Connected Line Presentation\n%@" = "إظهار الخط الموصول\n%@";
"Calling Line Presentation\n%@" = "إظهار خط الاتصال\n%@";
"Connected Line ID Restriction\n%@" = "تقييد معرف الخط الموصول\n%@";
"Calling Line ID Restriction\n%@" = "تقييد معرف خط الاتصال\n%@";
"SIM Lock\n%@" = "الـ SIM مقفل\n%@";
"Service Center Address\n%@" = "عنوان مركز الخدمة\n%@";
"Supplementary Service Password\n%@" = "كلمة سر الخدمة الإضافية\n%@";
"Calling Name Presentation\n%@" = "إظهار اسم الاتصال\n%@";

"Forwards to %@\n" = "تحويل إلى\n%@";

"All Calls" = "كافة الاتصالات";
"All Conditional Calls" = "كافة الاتصالات المشروطة";
"Async Data Circuit" = "دائرة البيانات غير المتزامنة";
"Data" = "بيانات";
"Fax" = "فاكس";
"Packet Access" = "وصول الحزمة";
"Pad Access" = "وصول الـ Pad";
"SMS" = "SMS";
"Sync Data Circuit" = "دائرة البيانات المتزامنة";
"Voice" = "صوتي";

"All Outgoing" = "كل الصادر";
"All Incoming" = "كل الوارد";
"Outgoing International" = "دولي صادر";
"Outgoing International, Except Home Country" = "الدولي الصادر، ما عدا بلد المنشأ";
"Incoming While Roaming Outside Home Country" = "الوارد خلال التجوال خارج بلد المنشأ";
"Incoming, Not On SIM" = "الوارد، ليس على الـSIM";
"All Services" = "كافة الخدمات";
"All Outgoing Services" = "كافة الخدمات الصادرة";
"All Incoming Services" = "كافة الخدمات الواردة";

"Disabled" = "تم الإيقاف";
"Enabled" = "تم التمكين";

"On All Calls" = "على كل الاتصالات";
"When Busy" = "عند الانشغال";
"When Unanswered" = "عند عدم الإجابة";
"When Unreachable" = "غير متاح";

"Setting %@ Succeeded" = "تم إعداد %@ بنجاح\n";
"Setting Interrogation Succeeded" = "تم إعداد الاستجواب بنجاح\n";
"Setting %@ Failed" = "فشل إعداد\n%@";
"Setting Interrogation Failed" = "فشل إعداد الاستجواب\n";

"Not Available" = "غير متوفر";
"Network Controlled" = "يتم التحكم من الشبكة";
"Temporarily Disabled" = "تم الإيقاف مؤقتًا";
"Temporarily Enabled" = "تم التمكين مؤقتًا";
"Unknown" = "غير معروف";

"Activation" = "التنشيط";
"Deactivation" = "إلغاء التنشيط";
"Interrogation" = "الاستجواب";
"Registration" = "التسجيل";
"Erasure" = "المسح";

"No Address" = "لا يوجد عنوان";
"No Service Specified" = "لا توجد خدمة محددة";
"Type %d" = "نوع %d";

// generic error
"CALL_FAILED" = "فشل الاتصال";
// error codes
"kCTNoError" = "لا يوجد خطأ";
"kCTUnknownError" = "خطأ غير معروف";
"kCTErrorRadioFailure" = "فشل الراديو";
// Generic network errors
"kCTErrorNetworkFailure" = "فشل الشبكة";
"kCTErrorCongestion" = "الشبكة مزدحمة";
"kCTErrorUnidentifiedSubscriber" = "مشترك غير معروف";
"kCTErrorFacilityRejected" = "تم رفض الأداة";
"kCTErrorUnknownSubscriber" = "مشترك غير معروف";
"kCTErrorNetworkOutOfOrder" = "الشبكة لا تعمل";
"kCTErrorInvalidTransactionIdentifier" = "معرف معاملة غير صالح";
"kCTErrorSemanticallyIncorrectMessage" = "رسالة غير صحيحة دلاليًا";
"kCTErrorInvalidMandatoryInformation" = "معلومات إلزامية غير صالحة";
"kCTErrorMessageTypeNonExistant" = "نوع الرسالة غير موجود";
"kCTErrorMessageNotCompatibleWithProtocolState" = "الرسالة غير متوافقة مع حالة البروتوكول";
"kCTErrorInformationElementNonExistant" = "عنصر المعلومات غير موجود";
"kCTErrorProtocolErrorUnspecified" = "خطأ البروتوكول غير محدد";
"kCTErrorTemporaryFailure" = "فشل مؤقت";
"kCTErrorResourcesUnavailable" = "الموارد غير متوفرة";
"kCTErrorRequestedFacilityNotSubscribed" = "لا يوجد اشتراك بالأداة المطلوبة";
"kCTErrorRequestedFacilityNotImplemented" = "لم يتم تطبيق الأداة المطلوبة";
"kCTErrorInterworkingError" = "خطأ تعامل";
"kCTErrorInterworkingNotSupported" = "التعامل غير مدعوم";
"kCTErrorCommandCannotBeActioned" = "لا يمكن تنفيذ الأمر";
"kCTErrorNoNetworkService" = "لا توجد خدمة شبكة";
// Call related errors
"kCTErrorUnassignedNumber" = "رقم غير مخصص";
"kCTErrorOperatorDeterminedBarring" = "حظر الاتصالات مقرر من قبل المشغّل";
"kCTErrorCallBarred" = "اتصال محظور";
"kCTErrorUserBusy" = "المستخدم مشغول";
"kCTErrorNoUserResponding" = "لا توجد إجابة من المستخدم";
"kCTErrorNumberChanged" = "تم تغيير الرقم";
"kCTErrorInvalidNumberFormat" = "تنسيق الرقم غير صالح";
"kCTErrorCallRejected" = "تم رفض الاتصال";
// SIM errors
"kCTErrorSimNotInserted" = "لم يتم إدخال الـ SIM";
"kCTErrorSimPinRequired" = "مطلوب رمز PIN للـ SIM";
"kCTErrorSimPukRequired" = "مطلوب رمز PUK للـ SIM";
"kCTErrorSimFailure" = "فشل الـ SIM";
"kCTErrorSimMemoryFailure" = "فشل ذاكرة الـ SIM";
"kCTBadPinFormatError" = "تنسيق الـ PIN غير صالح";
"kCTErrorNumberNotAllowed" = "الرقم غير مسموح";
"kCTErrorIncorrectPassword" = "كلمة السر غير صحيحة";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "تم رفض تحويل الرسالة القصيرة";
"kCTErrorDestinationOutOfOrder" = "الوجهة لا تعمل";
"kCTErrorClass0NotSupported" = "الطبقة صفر غير مدعومة";
"kCTErrorCannotReplaceSm" = "لا يمكن استبدال الـ SIM";
"kCTErrorUnspecifiedPid" = "الـ PID غير محددة";
"kCTErrorDataCodingSchemeNotSupported" = "نظام ترميز البيانات غير مدعوم";
"kCTErrorUnspecifiedDcs" = "خطأ DCS غير محدد";
"kCTErrorCommandUnsupported" = "الأمر غير مدعوم";
"kCTErrorUnspecifiedTpCommand" = "خطأ أمر TP غير محدد";
"kCTErrorTpduNotSupported" = "الـ TPDU غير مدعوم";
"kCTErrorScBusy" = "الـ SC مشغول";
"kCTErrorRejectedBySimSmsControl" = "تم الرفض من قِبل تحكم SIM SMS";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "الـ GPRS MS غير قانوني";
"kCTErrorGprsIllegalMe" = "الـ GPRS ME غير قانوني";
"kCTErrorGprsServicesNotAllowed" = "خدمات الـ GPRS غير مسموحة";
"kCTErrorGprsPlmnNotAllowed" = "الـ GPRS PLMN غير مسموح";
"kCTErrorGprsLocationAreaNotAllowed" = "موقع الـ GPRS غير مسموح";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "تجوال الـ GPRS غير مسموح في منطقة الموقع";
"kCTErrorGprsServiceOptionNotSupported" = "خيار خدمة الـ GPRS غير مدعوم";
"kCTErrorGprsServiceOptionNotSubscribed" = "لا يوجد اشتراك بخيار خدمة الـ GPRS";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "خيار خدمة الـ GPRS ليس في الخدمة حاليًا";
"kCTErrorGprsPdpAuthenticationFailure" = "فشل توثيق الـ GPRS PDP";
"kCTErrorGprsInvalidMobileClass" = "طبقة الجوال غير صالحة للـ GPRS";
"kCTErrorGprsUnspecified" = "الـ GPRS غير محدد";
"kCTErrorGprsMissingorUnknownAPN" = "‮GPRS مفقود أو APN غير معروف";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "تم رفض توثيق معلومات GPRS PDP من قِبل النطاق الأساسي";
